Catalogs/Renault_ПараметрыПодключенияКСервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПараметрыПодключенияКСервисам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ПараметрыПодключенияКСервисам/Ext/ManagerModule.bsl
Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	ПодключениеGate = Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate.ПолучитьОбъект();
	ПодключениеGate.Наименование = "WSGate Flotte";
	ПодключениеGate.АдресСервера = "http://gate.rnlt.ru/renault-ws-gate/ws/";
	ПодключениеGate.Логин = "FlotteServiceUser";
	ПодключениеGate.Пароль = "FlotteServiceUser";
	ПодключениеGate.Записать();
	
	// Трояновский К.Е. 26.02.2019 17:48:34 {
	//TO DO
	//ПодключениеOrders = Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate.ПолучитьОбъект();
	//ПодключениеOrders.Наименование = "Orders";
	//ПодключениеOrders.АдресСервера = "";
	//ПодключениеOrders.ИмяСервиса = "";
	//ПодключениеOrders.Логин = "";
	//ПодключениеOrders.Пароль = "";
	//ПодключениеOrders.Записать();	
	// Трояновский К.Е. 26.02.2019 17:48:34 }
	
КонецПроцедуры

Функция ПолучитьПараметрыПодключенияПоСсылке(ПодключениеСсылка, ИмяПубликацииСервиса) Экспорт
	
	АдресСервера = ПодключениеСсылка.АдресСервера;
	Адрес = АдресСервера + ИмяПубликацииСервиса + "?wsdl";
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Адрес", Адрес);
	СтруктураВозврата.Вставить("Логин", ПодключениеСсылка.Логин);
	СтруктураВозврата.Вставить("Пароль", ПодключениеСсылка.Пароль);
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьПараметрыПодключенияПоИмени(Имя, ИмяПубликацииСервиса) Экспорт
	
	Ссылка = Справочники.Renault_ПараметрыПодключенияКСервисам.НайтиПоНаименованию(Имя);	
	Возврат ПолучитьПараметрыПодключенияПоСсылке(Ссылка, ИмяПубликацииСервиса);
	
КонецФункции
